[{"id": "1878796", "tagline": "Kapildeo Singh vs The King on 24 January, 1950", "judgment": "\nThe appellant was charged with being a member of an unlawful assembly with the common object of dispossessing one Chulhan Tewari and assaulting and murdering one Nasiba Ahir and others. The prosecution case was that the appellant led a party of 60 or 70 men armed with a gun and lathis to the scene of occurrence. The Additional Sessions Judge found that, though the apparent title to the land was in the appellant and another, its possession had long been disputed. The appellant was convicted of firing a gun and injuring three people, including the deceased Nasiba Ahir. The appellant's party had gone onto the land armed with the gun and the persons injured were not of the complainant's party. The thirteen others who were charged along with the appellant were held not guilty as they were not properly identified as having taken part in the unlawful assembly. The appellant was found guilty of rioting, but not of causing injury with a gun. The court set aside the conviction and sentence under section 304 read with section 149, but maintained the conviction under section 147 and sentenced the appellant to two years' rigorous imprisonment. The first contention is without substance. The third contention is of no practical importance as the case should be remanded to the High Court for rehearing. The second contention must refer to the charge under s. 147, I.P.C., of which the appellant has been found to be guilty. The prosecution took upon itself the onus of proving that Chulhan Tewari was in possession of the disputed land. The charge of unlawful assembly was based on the dispossession of Chulhan Tewari, and the judge assumed that the question of possession was immaterial because both sides were determined to \"vindicate their rights by show of force or use of force\". The court held that this was too loosely stated, and that the nature of the injuries on both sides suggested that it was not a determined battle between two armed mobs. The conviction and sentence of the appellant were set aside and the case was remanded to the High Court with the direction that the appeal be reheard and disposed of according to law after recording a definite finding on the question of possession. This is the first appeal of its kind admitted by this Court in the exercise of its criminal jurisdiction. Leave to appeal in criminal cases could only be given where some clear departure from the requirements of justice is alleged to have taken place. In criminal cases, the Sovereign in Council does not act in the exercise of the prerogative right to review the course of justice unless it is shown that injustice of a serious and substantial character has occurred. This is usually treated as being for the final decision of the Courts below, and misdirection by a judge is insufficient for an appeal unless it results in a miscarriage of justice. The Board will not interfere in criminal cases unless there is a violation of justice or legal principles. This Court will follow the principles laid down in previous cases and will only interfere if it can be brought within those principles."}, {"id": "378583", "tagline": "Dhiyan Singh And Another vs Jugal Kishore And Another on 22 February, 1950", "judgment": "\nDhiyan Singh and Another v. Jugal Kishore and Another, Judgment dated 22/02/1950 by Bose, Vivian and Fazal Ali, Saiyid. Cited in 1952 AIR 145, 1952 SCR 478, 1953 SC 98, 1955 SC 481, 1961 SC 797, 1971 SC 1041, and 1976.\nA dispute arose between two sons of two brothers, S and B, after the death of S in 1884. B claimed the entire estate by survivorship, alleging that S died in a state of jointness. The dispute was settled through arbitration with an award known as \"Malik Mustaqil\" which M claimed conveyed an absolute estate to her. The award was acted upon and B is now estopped from contesting its validity. A dispute between M and B was referred to arbitration, and the award gave the suit properties to M and the rest of the estate to B. In 1884, a court awarded the disputed properties to two branches of a family, who each became permanent owners of their respective shares. Since then, each branch has been in possession of their allotted properties and dealing with them as absolute owners. The defendants claimed that the plaintiffs were bound by this award. In 1941, B's grandsons sued for the properties allotted to M, claiming that upon S's death, M only had a limited estate and that the plaintiffs were entitled to the property as next reversioners since M's son had predeceased her. The defendants argued that M had full rights to the property and was not subject to any limitations. The court held that the award gave an absolute estate to M, as the words \"Malik Mustaqil\" were strong, clear, and unambiguous, and were not qualified by other words or circumstances in the same document. Even if the award was assumed to be invalid, the plaintiff's claim was barred by the plea of estoppel. B was estopped because his conduct led M to believe that the decision of the arbitrator was fair and reasonable, and both parties would be bound by it, leading her to act greatly.\nThe court found that there was estoppel against B and his sons, as well as independent estoppel against B's son K. The court also found that there was estoppel against the plaintiffs who claimed through their father K."}, {"id": "1780900", "tagline": "Abdulla Ahmed vs Animendra Kissen Mitter on 14 March, 1950", "judgment": "\nAbdulla Ahmed and Animendra Kissen Mitter were involved in a legal dispute regarding the authority of a broker to conclude a contract. The court ruled that the broker had the authority to find a ready and willing buyer for the price fixed by the principal and thus concluded the contract.\nThe appellant, an estate broker, was employed by the respondent to negotiate the sale of a property at a minimum price of Rs. 1,00,000. The commission note stated that the broker had the right to negotiate the sale and receive a commission if successful. The principal also agreed to make out a good title for the property.\nI authorize you to sell my property for up to Rs. 1,10,000. If the price is between Rs. 1,00,000 and Rs. 1,05,000, I will pay you Rs. 1,000 as remuneration. If the price is between Rs. 1,05,000 and Rs. 1,10,000, I will pay you the whole of the excess over Rs. 1,05,000 in addition to your remuneration. If the price exceeds Rs. 1,10,000, I will pay you twenty-five percent of the excess amount over Rs. 1,10,000 in addition to Rs. 6,000 as stated above. This authority will remain in force The appellant found two people willing to purchase the property for Rs. 1,10,000 on June 2nd and communicated this to the respondent. The respondent cancelled the appellant's authority on June 9th and entered into an agreement with a nominee of the two people for a sale of the property for Rs. 1,05,000 and eventually executed a conveyance in their favour for Rs. 1,05,000. The court held that an owner employing an estate agent should not be taken to have authorized them to conclude a contract of sale, but the lack of such authority is not inconsistent with an understanding that the agent will receive a commission if a sale is made. The agent is entitled to his commission unless the owner and purchaser introduced by the agent carried the transaction to completion. Even if the commission note makes payment of commission conditional on completion of the transaction, the appellant acquired the right to the payment of commission on the basis of the price offered, subject to the condition that the buyers should complete the transaction.\nThe appellant was entitled to the commission of 5% on the sale of the property in question, as he had entered into a binding contract on behalf of the defendant.\nThe agent was entitled to his remuneration of Rs. 6,000 according to the terms of the commission note, even if the owner did not complete the transaction. The Luxor (Eastbourne) Ltd. v. Cooper case was distinguished, and Chadburn v. Moore, Rosenbaum v. Belson, Durga Charan Mitra v. Rajendra Nararain Sinha, and Wragg v. Lovett were referred to."}, {"id": "885778", "tagline": "Sheth Maneklal Mansukhbhai vs Messrs. Hormusji Jamshedji ... on 21 March, 1950", "judgment": "\nSheth Maneklal Mansukhbhai v. Messrs. Hormusji Jamshdji Ginwalla and Sons, 1950 AIR 1, 1950 SCR 75. Judgment by Mahajan, Mehr Chand; Fazal Ali, Saiyid; Mukherjea, B.K. Transfer case. A suit for ejectment of a lessee as a trespasser is maintainable if there is no registered lease deed, even if the lessee was put in possession and accepted rent for several years, due to the doctrine of partperformance. The Taluqdari Settlement Officer agreed to grant a permanent lease of certain plots of land located within a Taluqdari estate which was under the management of the Government under the Gujarat Taluqdars Act, 1888. The applicant offered to take certain plots on lease, subject to the Government's sanction and the terms of the lease, and sent a letter to the Government informing them of the offer. The government granted the defendant's predecessor permission to take possession of the estate in 1917, though a formal lease deed was not executed or registered. The Taluqdari Officer and the agent of the taluqdar, as well as the plaintiffs, were all put in possession of the estate.\nThe plaintiffs sued the defendant for trespassing as there was no registered lease deed. The court held that the correspondence between the defendant's predecessor-in-title and the plaintiffs showed that the defendant had a valid lease agreement.\nThe letter sent by the Taluqdari Officer to the Government, along with the Resolution of the Government dated 5th September, 1917, proved that there was a contract in writing to grant a lease on the terms stated in the Taluqdari Officer's letter. The Bombay High Court's judgment is reversed, as Section 53-A of the Transfer of Property Act applies to the case and the plaintiffs are not entitled to eject the defendant.\n\nThe court has determined that Section 53-A of the Transfer of Property Act applies to the case at hand. This section states that when a person is put in possession of property in furtherance of a contract, and the rents agreed upon are accepted for several years, the person in possession cannot be ejected by the rightful owner. Therefore, the plaintiffs are not entitled to eject the defendant, and the Bombay High Court's judgment is reversed."}, {"id": "1394213", "tagline": "Lakhi Narayan Das And Ors. vs The Province Of Bihar on 30 March, 1950", "judgment": "\n\nThese sixteen appeals arise out of applications presented by the appellants under section 491 of the Criminal Procedure Code, complaining of illegal detention under section 2 (1) (a) of the Bihar Maintenance of Public Order Ordinance, 1949. The validity of the Ordinance and the propriety of the detention orders were challenged in the Patna High Court, which rejected the applications but granted certificates to the appellants. The main point argued in support of the appeals is that the Ordinance has been promulgated by the Governor in contravention of the provisions of section 88 of the Government of India Act, and thus is void and inoperative. The courts cannot investigate the necessity of a Governor's decision to pass an ordinance, and the Ordinance must not contain provisions that would be invalid without the assent of the Governor-General. The Supreme Court of India held that the impugned Ordinance was not in conflict with any existing law and did not require the assent of the Governor-General to be valid. The court ruled that the Ordinance was a valid exercise of the provincial government's power to legislate on matters related to public order, and that there was no repugnancy between it and the concurrent list. The Ordinance is covered entirely by Items (1) and (2) of the Provincial List and as for no part of this provisions it is necessary to have recourse to the concurrent powers provided for in List III, the question of repugnancy under section 107(1) of the Government of India Act does not arise at all. The court held that the ordinance was valid and not repugnant to the Criminal Procedure Code. The court found that the Ordinance was valid, except for one section which was struck out. The main attack of the appellant's lawyer was directed at a proviso to Section 4 (1) of the Ordinance, which the court found was beyond the capacity of any Provincial Legislature to enact. The court concluded that the detention was still \"preventive detention\" and not \"arbitrary detention\", so it was within the power of the province to legislate on.\n\nThe Supreme Court dismissed the appeals of the appellants, as they were unable to show that any substantial error of law was involved in any of the cases or that there had been any irregularity in the procedure which led to a miscarriage of justice. The Court also rejected the contention of Mr. Umrigar, which argued that the Legislature exceeded its powers in enacting the provision of section 2 (1) (a) of the Bihar Maintenance of Public Order Act."}, {"id": "495914", "tagline": "Prandas vs The State on 14 March, 1950", "judgment": "\n\nIn this judgment, the High Court at Nagpur allowed the appeal of the Government of the Central Provinces and Berar against the acquittal of the appellant by the Sessions Judge of Bilaspur. The case of the prosecution was that on 15-8-1948, an altercation ensued between the appellant, Prandas, and the deceased, Gayaram, after a proposal to settle the dispute between them amicably by panchayat. Prandas proceeded with a lathi and inflicted several blows on Gayaram, resulting in his death. The High Court convicted the appellant for committing murder and causing hurt, sentencing him to transportation for life and three months' rigorous imprisonment under Sections 302 and 323 respectively of the Indian Penal Code Prandas and his relations were attacked by Hariram, Hiraram, Tiharu, and Bahartin, wife of Gayaram. The police registered a case and five people were charged with various crimes. The judge based his judgment mainly on the evidence of Thandaram and Agardas, who had witnessed only part of the occurrence. Thandaram, a witness in the case, gave an account of the altercation that was substantially different from the prosecution witnesses. He stated that Pran, helped by other accused as defenders, had a private right to defend his and their persons against an unjustified assault. The Sessions Judge relied on this evidence and other circumstances to come to the conclusion that the prosecution had proved that the appellant was responsible for the fatal injury of Gayaram. The High Court overturned the acquittal of the appellant, convicting him under Sections 302 and 323 of the Penal Code and sentencing him to transportation for life and three months' rigorous imprisonment respectively. They found that the prosecution evidence was supported by Agardas's testimony and corroborated by Hariram's first information report, but they stated that exception 4 to Section 300, Penal Code could not operate in his favour as it could not be said that he had acted in the exercise of his right of private defence. The High Court has the power to reverse a judgment of acquittal if the subordinate court misdirected itself, or if it is found that the accused had taken undue advantage, acted in a cruel or unusual manner, or the evidence upon which the order of acquittal was founded warrants a reversal. The High Court should also give proper weight and consideration to matters such as the views of the trial judge, the presumption of innocence in favor of the accused, the right of the accused to the benefit of any doubt, and the slowness of an appellate court in disturbing a finding of fact. The High Court's judgment can be supported on the short ground that on the evidence of Thandaram himself, the plea of the right of private defence could not be sustained. The next question which arises is whether the case falls under exception 4 to Section 300, Penal Code, which states that culpable homicide is not murder if it is committed without premeditation in a sudden fight in the heat of passion upon a sudden quarrel and without the offender's having acted in a cruel or unusual manner. The Sessions Judge was of the opinion that the version of the four interested prosecution witnesses did not support this exception. The High Court was justified in not giving the appellant the benefit of exception 4 to Section 300, Penal Code, as the evidence did not support the claim that he had not taken undue advantage or acted in a cruel or unusual manner. The High Court's conclusion that the appellant was not entitled to the benefit of exception 4 to Section 300 of the Penal Code could not be sustained, and so the conviction under Section 302 was changed to one under Section 304. The appellant was sentenced to five years of rigorous imprisonment and his conviction and sentence under Section 323 of the Penal Code will stand, with the sentences running concurrently."}, {"id": "308610", "tagline": "Ram Krishna Ramnath Agarwalof ... vs Secretary, Municipal ... on 14 March, 1950", "judgment": "\nBhawanipore Banking Corporation Ltd. v. Gouri Shankar Sharma, 1950 AIR 6, 1950 SCR 25. Judgment delivered on 14/03/1950 by Fazal Ali, Saiyid; Kania, Hiralal J. (CJ); Sastri, M. Patanjali; Mahajan, Mehr Chand; Das, Sudhi Ranjan. When an application for reopening a decree under Section 86 of the Bengal Money-Lenders Act is dismissed for default and an appeal from the order of dismissal is made, does this give a fresh starting point for limitation for execution of the decree?\nA preliminary decree on a mortgage was passed ex parte on August 21, 1940. The judgments debtor applied to have the decree reopened under Section 36 of the Bengal Money-lenders Act, but their application was dismissed for default of appearance on December 20.\n\nA final decree was passed on 22nd December, 1941. The judgment-debtor then filed an application under O. IX, r. 9 C.P.C. to restore the earlier application, which was dismissed on 1st June, 1942.\nThe court held that the decree holder's application for execution of the decree was valid, even if the word \"review\" in Art. 182 of the Indian Limitation Act, 1908, was used in a wide sense. The application under Section 36 of the Bengal Money Lenders Act was an application for review, so Clause 3 of Article 182 was not applicable to the case since the application had been dismissed for default and the court had no occasion to apply its mind to the question of whether the decree could or should be reviewed. The court held that the clause in Article 182 of the Constitution could not be applied because there had not been a review of the decree. The Court held that the first column of the Article and the appeal from the order dismissing the application under O. IX, r. 9, made in connection with the proceeding under s. 36 of Money-lenders Act, could not give a fresh starting point for limitation under Art. 182, cl. 2."}, {"id": "1264696", "tagline": "Bhawanipore Banking ... vs Gouri Shankar Sharma on 14 March, 1950", "judgment": " The Supreme Court has jurisdiction to entertain an application for leave to appeal against the decision of an Industrial Tribunal, which performs functions very near those of a Court. The Court will be reluctant to entertain such an application, but it can at least see that the rules according to which the Tribunal has to act and the provisions which are binding upon it are observed. The Appellate Court can also interfere if the Tribunal acts in excess of its jurisdiction or assumes a jurisdiction which it does not possess. In this case, the Court found that the appeal was not a proper case for interference with the adjudication of the Tribunal. The Supreme Court of India dismissed an appeal from the determination of an industrial dispute by an Industrial Tribunal appointed under Ordinance VI of 1949. The Court examined the provisions of the Constitution and determined that the word \"tribunal\" in Article 136 had been used in the same sense as \"Court,\" and that the word \"determination\" included within its scope the determinations made by industrial tribunals or other similarly constituted bodies. The Court held that whenever a tribunal, whether exercising judicial or quasi-judicial functions, determined a matter in a judicial manner, then such a determination was within Article 136. The Court concluded that the preliminary objection should be overruled and the appeal dismissed with costs.\nThe Supreme Court of India held that tribunals constituted under the Industrial Disputes Act, 1947, exercise quasi-judicial powers and are within the ambit of Article 136 of the Constitution. The tribunal is deemed to be a Civil Court for certain purposes and has all the necessary attributes of a Court of justice. It has no other function except that of adjudicating on a dispute and its adjudication has to be in accordance with evidence legally adduced and the parties have a right to be heard and being represented by a legal practitioner. The Supreme Court of India held that the decisions of industrial tribunals are appealable to the Supreme Court under Article 136 of the Constitution, even though the decision has to be declared binding by the appropriate government. The Supreme Court of India held that the Industrial Tribunal has similar attributes as that of a Court of Justice in view of the various provisions. The word \"Tribunal\" in Article 136 has to be construed liberally and not in any narrow sense, and an industrial tribunal, inasmuch as it discharges functions of a judicial nature in accordance with law, comes within the ambit of the article and this court can grant special leave against its orders. The court found that the tribunal did not follow proper procedure and quashed the award, ordering the tribunal to readjudicate the case. The Indian Industrial Disputes Act of 1950 established three classes of authorities to investigate and settle industrial disputes: conciliation officers, courts of enquiry, and industrial tribunals. The industrial tribunal is the only one that is considered a judicial tribunal, as it is composed of independent persons who are either current or former judges of a high court or district court, and its decisions are binding on the parties involved. The other two classes of authorities are administrative bodies that exercise quasi-judicial functions, meaning they do not strictly follow the law for their decisions. The Supreme Court of India held that an Industrial Tribunal formed under the Industrial Disputes Act is not a judicial tribunal and its determination is not a judicial determination in the proper sense of these expressions. The article is worded in the widest terms possible, but some sort of restricted interpretation may be unavoidable in view of the context in which particular words appear. With regard to tribunals which are not Courts in the proper sense of the expression, it may not be proper to lay down a hard and fast rule that no appeals could, on any account, be allowed against determinations of such tribunals. The best thing to do would be to examine each type of cases as it arises and if we find that with regard to determinations emanating from certain trib"}, {"id": "531294", "tagline": "The Bharat Bank Ltd., Delhi vs The Employees Of The Bharat Bank ... on 1 March, 1950", "judgment": "\nIn the case of Messrs. Khimji Poonja & Co. vs. Shri Baldev Das C. Parikh, the Supreme Court of India ruled on March 14, 1950 that the Bombay Cotton Contracts Act (IV of 1932), Section 8 (1) and East India Cotton Association Bye-laws, Nos. were applicable.\nThe validity of an arbitration and award under an cotton contract with a minimum deposit of Rs. 25 that is not in the prescribed form is determined by Section 8 of the Bombay Cotton Contractors Act, 1939. Bye-law 80 of the East India Cotton Association, Ltd., which was a recognised cotton association within the meaning of the Act, provided that contracts between members acting as commission agents on the one hand and their constituents on the other shall be subject to the bye-laws. Bye-law 51-A originally required a deposit of at least Rs. 9.5 per bale and the contract note contained a clause to that effect. During the war, this bye-law was amended by reducing the minimum amount. The government amended the form of the contract note by increasing the minimum deposit to Rs. 12-8 per bale and introducing a new bye-law (bye-law 65-A) which gave certain options to the last buyer. They also added two new clauses to comply with the bye-law 65-A.\nThe contract note rendered after amendments to the byelaws and form of contract note did not contain two new clauses introduced by the Government Notification, and was therefore not valid. The contract note was void because it did not include two new clauses that were required by the amended bye-laws, even though it stated that it was made in accordance with the bye-laws. Therefore, a valid award could not be made. The Bombay High Court's judgment was affirmed, as the omission of two clauses in the contract in question meant that the arbitration clause contained in the note was applicable. Patanjali Sastri J. preferred to rest his decision solely on this ground."}, {"id": "1812531", "tagline": "Messrs. Khimji Poonja And Company vs Shri Baldev Das C. Parikh on 14 March, 1950", "judgment": "\nDraw a star using asterisks.\nA blockchain is a distributed ledger that records transactions across multiple computers in a secure and permanent way.\nDraw a star. Require that any matter relating to a particular subject be dealt with in one place. All materials related to a class or subject must be reviewed before they can be published. Sub-clause (c) of the contract is not general, but is limited to a specific situation. The phrase \"particular subject or class of subject\" is used to refer to a specific topic or group of topics that are relevant to the context in which they are used. In the United States, law enforcement may use surveillance technologies such as drones and facial recognition only if they are connected to public safety or the maintenance of public order."}, {"id": "237273", "tagline": "Brij Bhushan And Anr. vs The State Of Delhi on 2 March, 1950", "judgment": "\n\nWe can use the Google Cloud Platform to quickly and easily deploy applications, store data, and manage resources. It offers a range of services that are secure, reliable, and cost-effective.\n\nCase statements are used to evaluate a value and execute different code based on the result. They are useful for making decisions in programming logic, such as determining which branch of code to execute based on user input.\nGorakhram appealed a civil case in 1948.\nLaxmibai, wife of Inderlal Nandlal, is the respondent in the case of Sadhuram.\nIn 1950, the Supreme Court of India ruled that the government had the right to take over private land for public use. The ruling stated that the government was allowed to do so as long as it provided fair compensation for the land taken. M.P. Sastri was an Indian mathematician and philosopher. He is best known for his contributions to the field of mathematics, particularly in the areas of algebra and number theory. He also wrote extensively on philosophy and religion. M.C. Mahajan and B.K. are two Indian judges who served on the Supreme Court of India. They both had distinguished careers and were known for their contributions to the development of Indian law.\nThe Supreme Court of India held that the Indian Constitution does not provide for the right to privacy as a fundamental right. However, it noted that the right to privacy is an inherent part of the right to life and personal liberty under Article 21 of the Constitution. The Court also held that certain aspects of privacy may be protected as a fundamental right under other provisions of the Constitution."}, {"id": "150369", "tagline": "Gorakhram Sadhuram vs Laxmibai Wife Of Inderlal Nandlal on 14 March, 1950", "judgment": "\nA.K. Gopalan v. The State of Madras, Union of India: Intervener was a 1950 Supreme Court judgment with Chief Justice Kania, Hiralal J., Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan and Mukherjea, B.K. on the bench.\nThe validity of the Preventive Detention Act (IV of 1950) and its sections 8, 7, 10-14 are examined in light of the Constitution of India, 1950, Articles 13, 19 to 22, 32. The law relating to preventive detention is evaluated to determine if it infringes on the fundamental right to freedom of movement. It is also determined if the law is subject to judicial review as to reasonableness under Article 19 (5). The scope of Article 19 is discussed, as well as the nature and incidents of the right of free movement and right to personal liberty. The scope and applicability of Article 22 is also discussed, as well as the meanings of \"law\" and \"procedure established by law.\" The Preventive Detention Act (Act IV of 1950) was found to be valid with the exception of Section 14, which was deemed to be ultra vires. Section 12 was also found to be ultra vires, and thus the detention of the petitioner was illegal. The Supreme Court ruled that Article 19 of the Constitution has no application to a law which relates directly to preventive detention, and the constitutional validity of such a law cannot be judged in the light of the test prescribed in Article 19(5). Article 19 of the Constitution of India protects some of the important attributes of personal liberty as independent rights, and the expression \"personal liberty\" is used in Article 21 as a compendious term including within its meaning all varieties of rights which go to make up the personal liberties of men. Article 22 does not form a complete code of constitutional safeguards relating to preventive detention, and on points of procedure which are not dealt with by Article 22, Article 21 will apply. The Supreme Court of India held that Article 21 of the Indian Constitution does not mean the jus naturale of civil law, but rather positive or State-made law. It also held that \"procedure established by law\" does not mean any procedure which may be prescribed by a competent legislature, but rather the ordinary well-established criminal procedure, i.e., those settled usages and normal modes of procedure sanctioned by the Criminal Procedure Code, which is the general law of criminal procedure in this country. Section 3 of the Preventive Detention Act, 1950 does not delegate any legislative power to an executive officer, but merely confers on such officer a discretion to enforce the law made by the legislature. Section 7 of the said Act is not invalid merely because it does not provide for an oral hearing or an opportunity to lead evidence, but only gives right to make a representation. Right to an oral hearing and right to give evidence are not necessarily implied in the right to make a representation given by Art. 22. The Supreme Court of India held that Article 22 (7) of the Indian Constitution, which states that Parliament may prescribe either the circumstances under which, or the class or classes of cases in which, a person may be detained for a period longer than three months without reference to an advisory board, is not violated by Section 12 of the Act, which enumerates the subjects for reasons connected with which a law of preventive detention could be made. The Court also noted that while speeches made in the course of debates on the bill should not be taken into consideration when construing the provisions of an Act, a higher value may be placed on the report of the Drafting Committee when construing the Constitution."}, {"id": "1857950", "tagline": "A.K. Gopalan vs The State Of Madras.Union Of ... on 19 May, 1950", "judgment": "\nThe Bharat Bank Ltd., Delhi, petitioned against the employees of the same bank in 1950. The Supreme Court bench of Kania, Hiralal J., Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand and Mukherjea, B.K. heard the case and delivered their judgment on 26/05/1950. The citation for the case is 1950 AIR 188 and 1950 SCR 459.\nR-4, 20, 6, 22, 23, 14, 13, 15\nR: 1963 SC 874 (8,9,17); 1965 SC1595 (18,19,40,41,42); 1967 SC1494 (13); 1979 SC1652 (29)\nF: 1962 SC1621 (60); 1963 SC 630 (6)\nRF: 1963 SC 677 (18,20); 1972 SC1967 (5); 1977 SC2155 (23)\nThe Supreme Court of India ruled on the maintainability of an application for special leave to appeal an award of an Industrial Tribunal under the Industrial Disputes Act, 1947. The Supreme Court held that the functions and duties of an Industrial Tribunal, created under the Industrial Disputes Act of 1947, are similar to those of a court, but it is not a court. This was decided under Article 136 of the Constitution. The Supreme Court of India has the jurisdiction to entertain an application for leave to appeal from a decision of an Industrial Tribunal under the Industrial Disputes Act. The powers of an appellate court cannot be fully and effectively exercised in respect of determinations made by a judicial tribunal, so such determinations are outside the purview of Article 136 of the Constitution.\nThe Court found that there was no ground for admitting the appeal and dismissed it. Mahajan J. dissented, finding that the award was bad and should be set aside."}, {"id": "653417", "tagline": "The Bharat Bank Ltd., Delhi vs Employees Of The Bharat Bank ... on 26 May, 1950", "judgment": "\nRomesh Thappar v. The State of Madras, 1950 AIR 124, 1950 SCR 594, Judgement dated 26/05/1950, Bench: Fazal Ali, Saiyid; Kania, Hiralal J. (CJ); Sastri, M. Patanjali; Mahajan, Mehr Chand; Das, Sudhi Ranjan; Mukherjea, B.K.\nF 1957 SC 620 (3,4,5,7)\nRF 1957 SC 628 (12,16,20,21)\nE&D 1957 SC 896 (14)\nRF 1958 SC 578 (129)\nF 1959 SC 395 (13,40)\nR 1959 SC 725 (8)\nR 1960 SC 633 (9,16)\nRF 1961 SC1457 (8)\nRF 1962 SC 171 (23)\nR 1962 SC 305 (29)\nR 1962 SC 955 (21)\nR 1962 SC1621 (78,108,110,132)\nR 1963 SC 996 (2,5)\nMV 1966 RF 1967 SC1110 (16), RF 1967 SC1643 (165,227), D 1969 SC 903 (23), D 1970 SC1923 (12,13), F 1971 SC2486 (8,13,14), R 1973 SC 106 (16), RF 1973 SC1461 (1705), RF 1974 SC1389 (247), RF 1977 SC 908 (23), R 1978 SC 597 (77), RF 1980 SC 494 (9), RF 1986 SC 515 (24,33,34), R 1986 SC 872 (74).\nThe Supreme Court held that the Madras Maintenance of Public Order Act (XXIII of 1949), s. 9(1-A) was valid, despite its restrictions on freedom of speech and expression. The Supreme Court of the United States has ruled that it will not refuse to entertain applications seeking protection against infringement of rights, even if the application is made to the court first without resorting to a High Court with concurrent jurisdiction. Freedom of speech and expression includes the freedom to propagate ideas, which is ensured by the freedom of circulation. The Supreme Court of India held that a law restricting freedom of speech and expression cannot fall within the reservation under clause (2) of article 19 of the Constitution, unless it is directed solely against the undermining of the security of the State or the overthrow of it. A law that authorises restrictions on a fundamental right in language wide enough to cover restrictions both within and without the limits of constitutionally permissible legislative action affecting such right is not possible to uphold, even so far as it applies to restrictions within the limits of constitutionally permissible legislative action. Section 9 (1-A) of the Constitution is unconstitutional and void, as it may be applied for purposes not sanctioned by the Constitution."}, {"id": "456839", "tagline": "Romesh Thappar vs The State Of Madras on 26 May, 1950", "judgment": "\nCommissioner of Income-Tax, Bombay v. Ahmedbhai Umarbhai & Co., Bombay (04/05/1950). Citation: 1950 AIR 134; 1950 SCR 335. Bench: Kania, Hiralal J. (CJ), Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan, Mukherjea, B.K.\nThis case discusses the applicability of Section 5 of the Excess Profits Tax Act, 1940 and Section 42 (3) of the Indian Income-tax Act, 1922. It examines whether profits made from the sale of an article manufactured outside British India are liable to excess profits tax, and if so, how they should be apportioned between the place of manufacture and the place of sale. A firm which was resident in British India and carried on the business of manufacturing and selling groundnut oil owned some oil mills within British India and a mill in Raichur in the Hyderabad State where oil was manufactured. The oil manufactured in Raichur would be deemed to be a separate business, the whole of the profits of which accrued or arose in an Indian State, and the other part of the business shall be deemed to be a separate business. The court held that the manufacturing operations of a business at Raichur were \"a part of the business\" of the assessees within the meaning of the proviso to section 5 of the Act, and that the profits of that operation were taxable. The profits derived from sales in Bombay, which was attributable to the manufacture of oil in Raichur, were exempt from excess profits tax under the proviso to section 5 of the Income Tax Act. The first part of sub-section (1) of section 42 of the Income-tax Act was applicable to the assessees, as the expressions \"business connection in British India\" and \"asset or source of income in British India\" covered their selling organisation at Bombay. It is not in accordance with business principles or practice to cut business operations in the absence of any statutory requirement to do so. The Supreme Court of India discussed whether profits resulting from a single continuous process ending in a sale can be apportioned into two or more portions. They concluded that profits are not wholly made by the act of sale and do not necessarily accrue at the place of sale. They also said that where raw material is worked up into a new product by a process of manufacture, it increases in value and this increase in value represents the income or profit which is attributable to the manufacturing operations. The profits from manufacturing must be located at the place of manufacture, regardless of where the goods are sold. It is possible to conceive of the two parts of the business being carried out by two different sets of people."}, {"id": "1467661", "tagline": "Commissioner Of Income-Tax, ... vs Ahmedbhai Umarbhai & Co., Bombay on 4 May, 1950", "judgment": "\nRashid Ahmed v. The Municipal Board, Kairana, The Union of India and The State was heard on 19/05/1950 by a bench consisting of Sudhi Ranjan Das, Hiralal J. Kania (CJ), Saiyid Fazal Ali, M. Patanjali Sastri, Mehr Chand Mahajan and B.K. Mukherjea. The case was cited as 1950 AIR 163 and 1950 SCR 566.\nThe Constitution of India grants the fundamental right to carry on trade, and this case discusses the reasonableness of restrictions imposed by U.P. Municipalities.\nA municipal byelaw prohibiting the carrying on of wholesale trade without permission is legal, even if it does not provide for issuing a license to existing traders and allows for the granting of a monopoly.\nBye-law No. 3 prohibited the sale of vegetables, fruit, etc. at any place other than the one fixed by the board, and Bye-law No. 4 granted a monopoly to a contractor to do wholesale business in vegetables for three years. The petitioner applied for a license to carry on his business at the place fixed as the market by the municipal board, where they had auctioned off the right to conduct business two years prior.\nA man applied for a license to open a shop, but his application was rejected due to the lack of provision in the byelaws. He was then prosecuted for contravention of the byelaws. He applied under Article 32 of the Constitution for the enforcement of his fundamental right as a citizen to carry on his business, which was guaranteed by Article 19(1) of the Constitution. The byelaw No.2 prohibited the petitioner from selling goods without a license, but the municipal board had granted a monopoly, making it impossible for them to grant a license. This restriction was not reasonable under Article 19(6) of the Constitution, so the byelaws were void and the prosecution of the petitioner was unlawful. The court held that the petitioner's business was not illegal and that an appeal under section 318 of the U. P. Municipalities Act was not an adequate legal remedy, thus allowing the petitioner to maintain the application."}, {"id": "1386061", "tagline": "Rashid Ahmed vs The Municipal Board, Kairana.The ... on 19 May, 1950", "judgment": "\nBrij Bhushan and another v. The State of Delhi, 26/05/1950, Fazal Ali, Saiyid, Kania, Hiralal J. (CJ), Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan, Mukherjea, B.K. 1950 AIR 129, 1950 SCR 605.\nConstitution of India Art. 19(1) is mentioned in 1960 SC 633 (9), 1962 SC 305 (25), 1962 SC 955 (21), 1966 SC 740 (48), 1967 SC 1643 (227), 1971 SC 2486 (8,13,14), 1973 SC 106 (16), 1986 SC 515 (22,24,33,97), and 1989 SC 190 (11). Section 7 (1) (c) of the East Punjab Public Safety Act, 1949 is valid as it relates to matters that disturb public safety or cause public disorder, including those which \"undermine the security of, or tend to overthrow, the State.\" The Provincial Government of Delhi may, by order in writing addressed to a printer, publisher or editor, require that any matter relating to a particular subject or class of subjects shall before publication be submitted for scrutiny if it is necessary for preventing or combating any activity prejudicial to the public safety or the maintenance of public order.\nThe Supreme Court of India held that Section 7(1)(c) of the Constitution, which authorized the imposition of restrictions on the fundamental right of freedom of speech and expression, was not a law relating to \"a matter which undermines the security of or tends to overthrow, the State\". The Supreme Court ruled that the expression \"public safety\" means the safety or security of the State, and the expression \"public order\" covers small disturbances of the peace which do not threaten the security of the State. The Act is a piece of special legislation that focuses on public safety. Public order can be interpreted as public tranquility, and public disorders which disturb the public tranquility undermine the security of the state.\nThe Full Court held that the imposition of pre-censorship on a journal is a restriction on the liberty of the press, which is an essential part of the right to freedom of speech and expression declared by Article 19 (1)(a) of the Constitution."}, {"id": "43023", "tagline": "Brij Bhushan And Another vs The State Of Delhi on 26 May, 1950", "judgment": "\nDr. N.B. Khare v. The State of Delhi, 1950 AIR 211, 1950 SCR 519, CJ Kania, Fazal Ali, Sastri, Mahajan, Mukherjea. Cited in 1952 SC 75, 1952 SC 196, 1956 SC 559, 1957 SC 510, 1957 SC 896, 1958 SC 578, 1959 SC 459, 1962 SC1371, 1964 SC1279, 1968 SC 445, 1971 SC1667, 1973 SC1461, 1974 SC 175, 1974 SC1044, 1975 SC2299.\nSection 4 of the East Punjab Public Safety Act of 1949 empowers the Provincial Government or District Magistrate to extern persons, authorizing externment for an indefinite period. The court must determine whether the restrictions imposed by this section are reasonable and valid. The District Magistrate may, by order in writing, give a direction that a person shall remove himself from and shall not return to any area specified in the order. Unless the Provincial Government directs otherwise, the order will not remain in force for more than three months. When an order is made, the grounds of it may be communicated to the person by the authority making the order. The petitioner, against whom an order under (1) (c) of the Act was passed applied to the Court under Art. 39, of the Constitution for a writ of certiorari contending that the order was illegal inasmuch as the provisions of the Act infringed the fundamental right to move freely throughout the territory of India which was guaranteed by Art. 19 (1) (d) of the Constitution and were accordingly void under Art. 13 (1) of the Constitution.\nThe Supreme Court ruled that the government must communicate the grounds to an externee when making an externment order, and that the order may remain in force for more than three months without a time limit. These restrictions imposed on the fundamental right guaranteed by Article 19(1)(d) of the Constitution were reasonable. Though certain authorities can be invested with power to make initial orders on their own satisfaction in cases of this description, the position would be different if the order thus made is allowed to continue for any indefinite period of time without giving the aggrieved person an opportunity to say what he has got to say against. Subsections 3 and 6 of Section 4 of the Act are unreasonable and violate Article 19 (5) of the Constitution, and are therefore void and inoperative under Article 13 (1). The Supreme Court held that the externment order was illegal, as it violated the fundamental right guaranteed by Article 19 (1) (d) of the Indian Constitution. The Court also held that when considering the reasonableness of restrictions imposed on this right, the Court can consider the procedural part of the law and the circumstances under which and manner in which the restrictions have been imposed."}, {"id": "1321505", "tagline": "Dr. N.B. Khare vs The State Of Delhi on 26 May, 1950", "judgment": "\nNanalal Zaver and Another v. Bombay Life Assurance Co. Ltd. and Others, 04/05/1950, Kania, Hiralal J. (CJ), Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan, Mukherjea, B.K., 1950 AIR 172, 1950 SCR 391. A company was incorporated and an outsider was attempting to gain control of the management by purchasing shares. The company issued further shares in order to prevent the outsider from gaining control, and offered new shares to existing shareholders. The validity of the resolution and offer were questioned, and the scope of Section 105-C of the Indian Companies Act of 1913 was discussed.\nAfter 5,404 shares had been subscribed for a company, the directors found someone trying to get control of the company by purchasing its shares. To prevent this, they resolved to issue the remaining 4,596 shares and offered these shares to the existing shareholders in proportion. Two shareholders of a company sued the company and its directors for a declaration that the resolution of the directors and the offer of new shares contravened the provisions of section 105-C of the Indian Companies Act, 1913, and was therefore illegal. The court held that the offer of shares to existing shareholders only, and not to any outsider, was legal.\nThe two requirements of section 105-C were met, and the resolution and offer did not violate the section, even though 272 shares remained undistributed due to the offer of four new shares for every five shares. The Supreme Court of India ruled that the fact that one of the motives for issuing further shares was to prevent an outsider from getting control of the company did not make the resolution or offer illegal. The Bombay High Court's decision was upheld, as the company was in need of additional funds and the resolution to issue more shares was necessary for the company's interests."}, {"id": "1679542", "tagline": "Nanalal Zaver And Another vs Bombay Life Assurance Co. Ltd.And ... on 4 May, 1950", "judgment": "\nCommissioner of Agricultural Income-Tax, Bengal v. Sri Keshab Chandra Mandal (1950) SCR 435: Supreme Court held that the respondent was liable to pay agricultural income tax.\nThe Bengal Agricultural Income-tax Act, 1944 allows illiterate assessees to submit returns in Form No. 5, with a declaration signed by the pen of their son or agent. The return is valid if signed by an agent, as per the maxim \"Qui facit per alium facit\". The Rules framed under the Bengal Agricultural Income-tax Act, 1944 provided that the declaration in a return of income had to be signed by the individual themselves. An illiterate assessee, Keshab Chandra Mandal, signed his return in the vernacular.\nThe Appellate Tribunal referred a question to the High Court regarding whether, in the circumstances of the case, the declaration in the form of return signed by the illiterate assessee by the pen of his son Jugal Chandra Mandal was valid. The High Court affirmed that the Bengal Agricultural Income-tax Act of 1944 and its Rules indicated an intention to treat the return of J.N. Banerjee & Co. as properly signed and valid, and this decision was upheld on appeal. The common law rule qui tacit per alium tacit per se was excluded in the matter of affixing signature to the return of income made by an individual assessee, as there was no physical contact between the assessee and the return. The return signed by the illiterate assessee with the pen of his son was not valid, as it was not properly signed. The Calcutta High Court's judgment was reversed, as there was nothing on the record to establish that the assessee did not touch the pen or the hand of the son when the signature was affixed."}, {"id": "254072", "tagline": "Commissioner Of ... vs Sri Keshab Chandra Mandal on 9 May, 1950", "judgment": "\nChief Controlling Revenue Authority and Superintendent of Stamps vs. Maharashtra Sugar Mills Ltd., judgment given on 27/05/1950 by Kania, Hiralal J. (CJ), Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, and Mukherjea, B.K.\nThe Indian Stamp Act (II of 1899) outlines the power of the High Court to refer a case upon request of a party affected, and whether an order directing the Chief Controlling Authority to refer is valid. The High Court has jurisdiction over matters concerning revenue, as per Section 266 (1) of the Government of India Act, 1935.\nCourt is not only for the benefit of the Revenue Authority, but also for the party affected by the assessment. It is therefore coupled with a duty to make a reference when asked to do so.\nThe court has the power to direct a third party to make a reference to the court if they decline to do so. This was established in Alcock Ashdown & Co. Ltd. v. Chief Revenue Authority (50 I.A. 227) and Julius v. Bishop of Oxford (5).\nThe High Court's order to a revenue officer to do his duty would not be considered the exercise of original jurisdiction in a matter concerning the revenue under Sec. 226 of the Government of India Act, 1935. The court will direct the Chief Controlling Revenue Authority to make a reference under Section 57 of the Stamp Act, despite Section 226 of the Government of India Act. The High Court can still direct the Revenue Authority to make a reference, even if payment has already been made. If the opinion of the Court is against the Revenue Authority, they will have to refund whatever has been recovered in excess, according to Section 59 (2) of the Act."}, {"id": "269585", "tagline": "Chief Controlling Revenue ... vs Maharashtra Sugar Mills Ltd on 27 May, 1950", "judgment": "\nRachpal Mahraj v. Bhagwandas Daruka and Others, 05/05/1950, Bench: Sastri, M. Patanjali, Kania, Hiralal J. (CJ), Das, Sudhi Ranjan, Citation: 1950 AIR 272, 1950 SCR 548.\nThe question of whether a memorandum of deposit of title deeds is compulsorily registrable under section 17 of the Indian Registration Act, 1908. Whether a deposit is considered an instrument creating an interest in immoveable property depends on whether the parties intended to reduce their bargain regarding the deposit to a document. If so, the document requires registration. If not, its proper construction and the surrounding circumstances must be taken into account. The contract to create a mortgage arises by implication of the law from the deposit itself with the requisite intention, and the document does not require registration. Time is not a decisive factor. On a certain date, the appellant gave title deeds to the respondents as security for amounts due and also gave a memorandum to them.\nWe are writing to inform you that we have taken measures to ensure the repayment of money already owed to you and any future money due from our business transactions.\nThe parties did not intend to create a charge by the execution of the document, but merely to deposit title deeds with intent to create an equitable mortgage.\nThe court held that a document which records a transaction which has already been concluded and under which rights and liabilities have already been created does not require registration. The court cited Obla Sundarachariar v. Narayana Ayyar (53 I. A, 68) and Hari Sankar Paul v. Kedar Nath Saha (66 I.A. 184) as reference."}, {"id": "1582547", "tagline": "Rachpal Mahraj vs Bhagwandas Darukaand Others on 5 May, 1950", "judgment": "\nThe New Piecegoods Bazar Co., Ltd. v. The Commissioner of Income-Tax, Bombay, 1950. Judgment by Mahajan, Mehr Chand; Fazal Ali, Saiyid; Sastri, M. Patanjali; and Mukherjea, B.K.\nThe Indian Income-tax Act (XI of 1922) states that deductions can be made for an \"annual charge, not being a capital charge\" when computing income from property. This case discusses the meaning of \"annual charge\" and how it differs from a capital charge. The capital charge is a charge for municipal property tax and urban immoveable property tax in the City of Bombay. It is deductible under the Municipal Act, 1888, s. 212 and the Bombay Finance Act, 1932, s. 22. Yes, the charge created in respect of municipal property tax by s. 212 of the City of Bombay Municipal Act, 1888 is an annual charge not being a capital charge. The meaning of Section 9 (1) (iv) of the Indian Income-tax Act, 1992 is that any charge imposed on a property should be deducted in computing the income from such property. The Bombay Finance Act, 1939 created a charge in respect of urban immoveable property tax, which is similar to the purposes of s. 9 of the Indian Income-tax Act.\nThe expression \"capital charge\" in s.9(1) (iv) means a charge created for a capital sum, which is to be deducted from the amount due to the creditor. A capital charge is a charge created to secure the discharge of a liability of a capital nature, while an annual charge is a charge to secure an annual liability."}, {"id": "1072049", "tagline": "The New Piecegoods Bazar Co., ... vs The Commissioner Of ... on 26 May, 1950", "judgment": "\nThe Commissioner of Income-Tax, U.P. v. Gappumal Kanhaiya Lal was decided on 26/05/1950 by the bench of Fazal Ali, Saiyid; Sastri, M. Patanjali; Mahajan, Mehr Chand; and Mukherjea, B.K.\nThe Indian Income-tax Act (XI of 1922) allows for a deduction when computing the annual value of income from property. Municipal house-tax and watertax are annual charges which are not capital charges, and are deductible under the U.P. Municipalities Act (II of 1916), ss. 128, 149, and 177.\nThe amount of house tax and water tax imposed by the Municipal Board of Allahabad under Section 128 of the United Provinces Municipalities Act, 1916, and paid.\nAnnual charges for a lease under s. 149 of the Act are not considered capital charges. The property should be deducted from the bona fide annual income, as it is subject to s. 9 (1) (iv) of the Indian Income-tax Act, 1992. The Allahabad High Court affirmed the value of the property determined under sub-sections (1) and 12) of s. 9 of the Indian Income-tax Act. The Supreme Court of India held that the New Piecegoods Bazar Co. Ltd. was liable to pay income tax on its profits, as per the decision in I.L.R. 1943 Bom. 628."}, {"id": "1055461", "tagline": "Commissioner Of Income-Tax, U.P vs Gappumal Kanhaiya Lal on 26 May, 1950", "judgment": "\nThis application under Article 32 of the Constitution of India for a writ of 'habeas corpus' made by Ashutosh Lahiry at present detained in District Jail, Delhi, raises two questions: (1) that the Preventive Detention Act, 1950 takes away or abridges the fundamental rights of the Indian citizens conferred by Part III of the Constitution and is accordingly void under Article 13(2) of the Constitution; and (2) that the Order of detention has been made 'mala fide' and is an abuse of power and as such void, illegal and inoperative. The first question is now concluded by the decision of this Court which upheld the validity of the impugned Act. In order to determine the second question, it is\nThe petitioner actively took part in relief work for refugees pouring into West Bengal due to Hindu feelings running high. He issued a press statement against a 'hartal' and his appeal caused it to fail. He then attended a public meeting in Delhi where intemperate speeches were made, leading to a communal riot. At a press conference he gave an exaggerated version of the happenings in Bengal and East Bengal. The Hindu Mahasabha then called meetings of its Working Committee and All India Committee for the 1st and 2nd of April. In April 1950, the petitioner was served with a detention order and grounds of detention under Section 7 of the Act. The grounds of detention stated that the petitioner had held a press conference in which he gave a highly exaggerated and communal version of happenings in Bengal and East Bengal, and his activities were likely to create hatred between different communities which may lead to disturbance of public peace and order. The petitioner denied these allegations, claiming that his object in coming to Delhi was not to create any communal bitterness. The District Magistrate of Delhi made an order to detain the petitioner with a view to preventing him from acting in a manner prejudicial to the maintenance of public order. It is well settled that the satisfaction of the authority making the order as to the matters specified in the Act is the only condition for the exercise of his powers and that the Court cannot substitute its own satisfaction for that of the authority. However, it is open to the detenu to establish, if he can, that the order was made 'mala fide' and in abuse of powers.\nThis is an application for a writ of Ashutosh Lahiry who complains of illegal detention in the Delhi Jail in pursuance of an order of the District Magistrate of Delhi made under Section 3 (2) of the Preventive Detention Act. The petitioner's counsel argued that the Preventive Detention Act of 1950 is 'ultra vires' the Constitution and any detention made under its provisions is illegal and inoperative in law. The Court found that the communal situation in Delhi was tense and the District Magistrate felt it necessary to take action against the petitioner. The Court was not convinced that the act of the District Magistrate was actuated by any improper or indirect motive and thus dismissed the petition. The court held that the Preventive Detention Act was not ultra vires the Constitution, and that the order of detention may be declared invalid if it could be proved to have been made by the authority concerned in mala fide exercise of their power. The burden of proving the absence of good faith is upon the petitioner. From the facts set out in the affidavit of the petitioner, it appears that the petitioner is a member of the Working Committee as well as of the All India Committee of the Hindu Mahasabha. The Hindu Mahasabha was scheduled to hold a meeting on April 1st and 2nd of 1950, but the President, General Secretary and Organizing Secretary were externed from Delhi on the same day. On the same day, an order was served upon the petitioner (the person being detained) directing his detention under the Preventive Detention Act. It was stated in the grounds of detention that the petitioner had given a highly exaggerated and communal version of happenings in Bengal and East Bengal at a press conference, and that his activities were likely to create hatred between different communities and lead to disturbance of public peace and order. The District Magistrate had ample powers under the ordinary law to prevent any disturbance of communal peace, and it is difficult to understand why the petitioner was detained under the Preventive Detention Act. It is possible that there was a lack of good faith on the part of the authorities, and it is important that these extraordinary powers are not misused in order to avoid injustice or oppression."}, {"id": "861263", "tagline": "Ashutosh Lahiry vs The State Of Delhi And Anr. on 19 May, 1950", "judgment": "\nDr. Babu Ram Saksena v. The State was a case heard by the Supreme Court of India on 05/05/1950. The bench consisted of Justices M. Patanjali Sastri, Hiralal J. Kania (CJ), Saiyid Fazal Ali, Mehr Chand Mahajan, Sudhi Ranjan Das and B.K. Mukherjea. The case concerned the Constitution of India and the effect of a treaty of extradition between the British Government and an Indian State.\nIn 1869, the British Government and the State of Tonk entered into a treaty which provided for the extradition of offenders in respect of certain offences specified therein called \"heinous offences\". In 1903, the Extradition Act was passed which allowed for extradition for additional offences not specified in the treaty. This does not derogate from the treaty, and an extradition warrant can be issued for additional offences. The Indian Extradition Act was passed, which allowed for extradition in cases of cheating and extortion. Section 18 of the Act stated that nothing in the Act should take away from any existing treaty for extradition of offenders. Under the Independence of India Act, 1947, suzerainty of His Majesty over the Indian States lapsed, along with all treaties and agreements in force.\nIn 1947, Tonk became a member state of the United State of Rajasthan and was subject to a standstill agreement with the Indian Dominion. This agreement included extradition agreements, meaning that the appellant, a member of the Uttar Pradesh Civil Service, was subject to extradition. In 1948, a man was charged with cheating and extortion in the State of Tonk. He was arrested under an extradition warrant issued under Section 7 of the Extradition Act, 1903. He applied under Sections 4=91 and 561-A of the Code of Criminal Procedure for his release. The court held that even if the Extradition Treaty of 1869 still applied after the merger of the Tonk State, providing for extradition for additional offenses, the arrest was still illegal due to the provisions of s. 18 of the Extradition Act. The Extradition Act of 1903 did not change the rights of Indian citizens under the Treaty of 1869, and so the arrest and surrender of the appellant under Section 7 of the Act was not unlawful. The Supreme Court of India held that the warrant of arrest issued under Section 7 of the Extradition Act of 1903 was valid, as no enforceable treaty right existed and the conditions of the said Act had been complied with."}, {"id": "390835", "tagline": "Dr. Babu Ram Saksena vs The State on 5 May, 1950", "judgment": "\nPetitioner Pritam Singh vs. Respondent The State, Judgment Date 05/05/1950, Bench: Fazal Ali, Saiyid; Sastri, M. Patanjali; Mahajan, Mehr Chand; Mukherjea, B.K.; Das, Sudhi Ranjan. Citation 1950 AIR 169, 1950 SCR 453.\nRF 1954 SC 20 (5); F 1954 SC 23 (13); R 1954 SC 271 (11); R 1956 SC 217 (31,35,44).\nR 1958 SC 61 (8,9)\nF 1961 SC 100 (2)\nRF 1961 SC 1708 (9)\nR 1964 SC 1645 (9)\nRF 1976 SC 758 (8); F 1977 SC 472 (5); R 1986 SC 702 (12); R 1988 SC 1883 (245).\nThe Supreme Court will not grant special leave to appeal under Article 136(1) of the Constitution of India. The Supreme Court will not review a decision of the lower court unless exceptional and special circumstances exist, substantial and grave injustice has been done, and the case presents features of sufficient gravity to warrant a review. Once an appeal has been admitted by special leave, the appellant is free to contest all findings of fact and raise any point that could be raised in the original case. The High Court is incorrect. Points that are fit to be urged at the preliminary stage when leave to appeal is asked for must be urged at the final hearing of the appeal. \n\nThe High Court is incorrect in this case. According to Ibrahim v. Rex ([1914] A.C. 615), points that are fit to be urged at the preliminary stage when leave to appeal is asked for must be urged at the final hearing of the appeal. This means that any points that could have been argued at the preliminary stage should also be argued at the final hearing. If not, they may not be considered by the court."}, {"id": "743851", "tagline": "Pritam Singh vs The State on 5 May, 1950", "judgment": "\n\nThis appeal is about an application for revocation of leave obtained by the appellant to sue for a declaration that a partnership entered into with the respondent had been dissolved, or alternatively, for a dissolution of the partnership and for accounts and other consequential reliefs. The suit was instituted on 17-2-1947 and the appellant applied for a temporary injunction and the appointment of a receiver to take charge of the partnership assets. The respondent entered appearance on 11-3-1947 and an order was passed appointing two joint receivers to collect money due to the partnership. The Eastern Command Court dismissed the appellant's application for injunction and receiver, but allowed joint receivers to take charge of all the books of account of the partnership business. The respondent applied for and obtained an extension of time to file his written statement, in which he denied the genuineness of the letter relied on by the appellant as showing that the partnership related to all the contracts undertaken by the respondent. He put forward a deed of partnership dated 3-4-1946 as embodying the terms of the partnership, and alleged that it was entered into and executed in Bihar. The court had no jurisdiction to entertain the suit as no part of the cause of action arose in Calcutta and the leave obtained on false allegations should be revoked. The appellant argued that the application for revocation of leave was inspired by the observations made by Clough J. in his judgment dismissing the appellant's application for appointment of a receiver, which were made without due appreciation of the matter. The Judge hearing the application said it was impossible to find as a fact that Calcutta was not a convenient forum for the appellant, and held that the balance of convenience was not so against the suit being brought in Calcutta that the leave granted should be revoked on that ground. The respondent was found to have acted inappropriately in obtaining an order that would be to his own advantage, and allowing the proceedings to continue involving expenses which could have been avoided. An appeal was filed against the order and a stay of proceedings was granted until the appeal was heard. The appeal was heard by the Chief Justice and Mukherjea J., who set aside the judgment of Clough J. and directed that the leave granted under Clause 12, Letters Patent be revoked, that the plaint filed in the appellant's suit \"be taken off the file\" and that the appellant be at liberty to institute a fresh suit in the Court of appropriate jurisdiction in the State of Bihar on the same cause of action. The appellant argued that it would be harassing and vexatious to have the suit tried on the original side of the court. The appellate bench disagreed, saying that it was not necessary to call any evidence or handwriting experts to prove the contract. The appellant challenged this conclusion, arguing that it was necessary to summon witnesses in Calcutta and handwriting experts to prove the respondent's signature on a letter. The court held that, having regard to the delay in filing the application for revocation and the respondent's conduct in relation to the proceedings in the suit, the leave originally granted should not be revoked.\nThe respondent entered appearance on the 11th March and then filed an application for revocation of the suit in order to take advantage of the sum of Rs. 21,000/- due from the military authorities at Tollygunge. This was because the Department of the Garrison Engineer, Eastern Command, Tollygunge, was going to be abolished as and from the 31st March 1947. The application for revocation was seen as an after-thought inspired by the observation of Clough J. in his order dated 25-4-1947, which suggested that the suit was filed in Calcutta with a view to harass the respondent. When the respondent filed the application for revocation on 2-5-1947, it was denied. The respondent had allowed the appellant to proceed with the suit and incur considerable expenses, but then applied for revocation of leave. The court found that it would result in grave injustice if the Court were to hold that the 'forum conveniens' was Bihar and not Calcutta and revoke the leave on that ground, so the appeal was allowed and the respondent's application for revocation of leave was dismissed with costs."}, {"id": "1278776", "tagline": "Chittaranjan Mukherji vs Barhoo Mahto on 5 May, 1950", "judgment": "\nA.K. Gopalan v. The State of Madras, Union of India: Intervener was a 1950 Supreme Court case in which the petitioner A.K. Gopalan argued against the State of Madras and the Union of India intervened. The judgment was delivered on 19/05/1950 by Chief Justice Hiralal J. Kania, along with Justices Fazal Ali, M. Patanjali Sastri, Mehr Chand Mahajan, Sudhi Ranjan Das, and B.K. Mukherjea.\nThe validity of the Preventive Detention Act (IV of 1950) and its sections 8, 7, 10-14 are discussed in terms of their compliance with Articles 13, 19 to 22, and 32 of the Constitution of India, 1950. The law relating to preventive detention is examined to determine whether it infringes on the fundamental right to freedom of movement. It is also determined whether the law is subject to judicial review as to its reasonableness under Article 19(5). The scope of Article 19 is discussed, as well as the nature and incidents of the right of free movement and right to personal liberty. The scope and applicability of Article 22 is also discussed, as well as the meanings of \"law\" and \"procedure established The Preventive Detention Act of 1950 is valid with the exception of Section 14, which contravenes Article 9.9 (5) of the Constitution. This invalidity does not affect the validity of the Act as a whole, and thus the detention of the petitioner was not illegal. Article 19 of the Constitution has no application to a law which relates directly to preventive detention even though as a result of an order of detention the rights referred to in sub-clauses (a) to (e) and (g) in general, and sub-clause (d) in particular, of clause (1) of Article 19 may be restricted or abridged; and the constitutional validity of a law relating to such detention cannot therefore, be judged in the light of the test prescribed in clause (5) of the said Article. Article 19 of the Constitution of India protects some of the important attributes of personal liberty as independent rights, and the expression \"personal liberty\" is used in Article 21 as a compendious term including within its meaning all varieties of rights which go to make up the personal liberties of men. Article 22 does not form a complete code of constitutional safeguards relating to preventive detention, and on points of procedure which are not dealt with by Article 22, Article 19 will apply. The Supreme Court of India ruled that the word \"law\" in Article 21 of the Indian Constitution does not mean the jus naturale of civil law, but rather means positive or State-made law. Furthermore, \"procedure established by law\" does not mean any procedure which may be prescribed by a competent legislature, but rather the ordinary well-established criminal procedure, i.e., those settled usages and normal modes of procedure sanctioned by the Criminal Procedure Code, which is the general law of criminal procedure in this country. Section 3 of the Preventive Detention Act, 1950 does not delegate any legislative power to an executive officer, and is therefore not invalid. Section 7 of the Act is not invalid because it does not provide for an oral hearing or an opportunity to lead evidence, but only gives the right to make a representation. Right to an oral hearing and right to give evidence are not necessarily implied in the right to make a representation given by Art. 22. The Supreme Court ruled that Article 22(7) of the Indian Constitution does not require both the circumstances and classes of cases to be prescribed for a person to be detained for more than three months. Parliament has in fact prescribed both in clauses (a) and (b) of sub-section (1) of Section 12, making it valid. However, speeches made in the course of debates on the bill should not be taken into consideration when construing the provisions of an Act."}, {"id": "1857950", "tagline": "A.K. Gopalan vs The State Of Madras.Union Of ... on 19 May, 1950", "judgment": "\nThe Bharat Bank Ltd. of Delhi filed a petition against the employees of the same bank, and the Supreme Court ruled in favor of the petitioner on 26/05/1950. The bench included Chief Justice Hiralal J. Kania, Fazal Ali, Saiyid, M. Patanjali Sastri, Mehr Chand Mahajan, and B.K. Mukherjea. The citation for this case is 1950 AIR 188 and 1950 SCR 459.\nR: 4, 6, 14, 13, 22, 23\nF: 16\nD: 13\nRF: 15\n\nR 1962 SC1621 (60)\nF 1963 SC630 (6)\nRF 1963 SC677 (18,20)\nR 1963 SC874 (8,9,17)\nR 1965 SC1595 (18,19,40,41,42)\nR 1967 SC1494 (13)\nRF 1972 SC1967 (5)\nRF 1977 SC2155 (23)\nR 1979 SC1652 (29)\nThe Constitution of India allows for appeals to the Supreme Court under Article 136. This application is for special leave to appeal an award of an Industrial Tribunal, and whether it is maintainable under the Industrial Disputes Act 1947, section 8. The Industrial Tribunal constituted under the Industrial Disputes Act, 1947 is not a court but has similar functions and duties to one. This was held by a bench of three members, with two dissenting. The Supreme Court of India has the jurisdiction to entertain an application for leave to appeal from the decision of an Industrial Tribunal, even though it may be difficult to do so. Even if it were assumed that a judicial tribunal's determinations could be appealed under Article 136 of the Constitution, the nature of the determinations and the materials and considerations on which they are based make it so that the powers of an appellate court cannot be exercised fully and effectively in respect of them.\nThe Court found that there was no ground for admitting the appeal and thus declined to entertain it. Mahajan J. dissented, believing that the award should be set aside."}, {"id": "653417", "tagline": "The Bharat Bank Ltd., Delhi vs Employees Of The Bharat Bank ... on 26 May, 1950", "judgment": "\nRomesh Thappar v. The State of Madras, 1950 AIR 124, 1950 SCR 594, was decided by a bench of Fazal Ali, Saiyid, Kania, Hiralal J. (CJ), Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan, and Mukherjea, B.K. on 26/05/1950.\nF 1957 SC 620 (3,4,5,7)\nRF 1957 SC 628 (12,16,20,21)\nE&D 1957 SC 896 (14)\nRF 1958 SC 578 (129)\nF 1959 SC 395 (13,40)\nR 1959 SC 725 (8)\nR 1960 SC 633 (9,16)\nRF 1961 SC1457 (8)\nRF 1962 SC 171 (23)\nR 1962 SC 305 (29)\nR 1962 SC 955 (21)\nR 1962 SC1621 (78,108,110,132)\nR 1963 SC 996 (2,5)\nMV 1966 R, RF The Supreme Court held that the Madras Maintenance of Public Order Act (XXIII of 1949), s. 9 (1-A) was valid. The Supreme Court has the responsibility to protect rights, and it cannot refuse to entertain applications for protection against infringement of such rights, even if the application is made to the court in the first instance without resorting to a High Court. Freedom of speech and expression includes the freedom of propagation of ideas, which is ensured by the freedom of circulation. The Supreme Court of India held that a law restricting freedom of speech and expression cannot fall within the reservation under clause (2) of article 19 of the Constitution, unless it is directed solely against the undermining of the security of the State or the overthrow of it. A law that authorises restrictions on a fundamental right in language wide enough to cover both within and without the limits of constitutionally permissible legislative action affecting such right is not possible to uphold, even so far as it applies within those limits. Section 9 (1-A) of the law in question is unconstitutional and void, as it cannot be applied within the constitutional limits."}, {"id": "456839", "tagline": "Romesh Thappar vs The State Of Madras on 26 May, 1950", "judgment": "\nCommissioner of Income-Tax, Bombay v. Ahmedbhai Umarbhai & Co., Bombay (04/05/1950). Citation: 1950 AIR 134; 1950 SCR 335. Bench: Kania, Hiralal J. (CJ), Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan, Mukherjea, B.K.\nThis case discusses the applicability of Section 5 of the Excess Profits Tax Act, 1940 and Section 42 (3) of the Indian Income-tax Act, 1922 to a business in which part of the profits made during the chargeable accounting period were chargeable to income tax. It examines whether the manufacturing operations are considered part of the business and if so, if it is permissible to apportion the profits between the place of manufacture and the place of sale.\nA firm which was resident in British India and carried on the business of manufacturing and selling groundnut oil, owned some oil mills within British India and a mill in Raichur in the Hyderabad State where oil was manufactured. The Act shall not apply to the profits of the mill in Raichur, as it is deemed to be a separate business, the whole of the profits of which accrued or arose in an Indian State. The court held that the manufacturing operations carried out by the firm at Raichur were \"a part of the business\" of the assessees within the meaning of the proviso to section 5 of the Act, and that the profits of that part of the business should be taxed accordingly. The part of the profits derived from sales in Bombay which was attributable to the manufacture of oil in Raichur was exempt from excess profits tax under the proviso to section 5 of the Act. Section 42 of the Income-tax Act was applicable to the assessees, as the expressions \"business connection in British India\" and \"asset or source of income in British India\" were wide enough to cover their selling organization at Bombay. It is not in consonance with business principles or practice to cut business operations in the absence of any statutory requirement to do so. The Supreme Court of India held that profits from a continuous process ending in a sale do not necessarily accrue at the place of sale, and that profits attributable to manufacturing operations accrue at the place where the operations are carried on. They also discussed whether Kirk's case is applicable to assessments under the Indian Acts as laying down any general principle of apportionment. The profits from manufacturing are located at the place of manufacture, regardless of where the goods are sold. The profits can be thought of as coming from two different sets of people."}, {"id": "1467661", "tagline": "Commissioner Of Income-Tax, ... vs Ahmedbhai Umarbhai & Co., Bombay on 4 May, 1950", "judgment": "\nRashid Ahmed vs. The Municipal Board, Kairana, The Union of India and The State, Judgement Date: 19/05/1950, Bench: Das, Sudhi Ranjan, Kania, Hiralal J., Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Mukherjea, B.K., Citation: 1950 AIR 163, 1950 SCR 566.\nThe Constitution of India, Articles 19 (1) and 19 (6), provide the fundamental right to carry on trade. This case examines the reasonableness of restrictions imposed by U.P. Municipalities.\nA municipal byelaw prohibiting the carrying on of wholesale trade without permission is legal, even if it does not provide for issuing a license to old traders and allows for the granting of a monopoly.\nBye-law No. 3 prohibited the sale of vegetables, fruit, etc. at any place other than the one fixed by the board, and Bye-law No. 4 granted a monopoly to a contractor to do wholesale business in vegetables for three years. The petitioner, who had been carrying on wholesale business in vegetables at a rented shop within the municipality for two years before the byelaws came into force, applied for a license to carry on his business at the place fixed as the market by the municipal board where the business was auctioned off to the highest bidder.\nA man applied for a license to open a shop, but it was rejected because there was no provision in the byelaws authorizing the grant of such a license. He was prosecuted for contravening the byelaws and applied under Article 32 of the Constitution for enforcement of his fundamental right as a citizen to carry on his business which was guaranteed by Article 19(1) of the Constitution. The byelaw No.2 was absolute and the municipal board had granted a monopoly, making it impossible for them to grant a license to the petitioner. This restriction was not reasonable according to Article 19(6) of the Constitution, so the byelaws were void and the prosecution of the petitioner was unlawful. The court held that the petitioner was not acting illegally, and that the fact that the Constitution came into force after the byelaws did not affect the petitioner's right to carry on their business. Additionally, an appeal under section 318 of the U. P. Municipalities Act was not an adequate legal remedy, and thus the petitioner was entitled to maintain their application."}, {"id": "1386061", "tagline": "Rashid Ahmed vs The Municipal Board, Kairana.The ... on 19 May, 1950", "judgment": "\nBrij Bhushan and another v. The State of Delhi, 26/05/1950, Bench: Fazal Ali, Saiyid; Kania, Hiralal J. (CJ); Sastri, M. Patanjali; Mahajan, Mehr Chand; Das, Sudhi Ranjan; Mukherjea, B.K. 1950 AIR 129, 1950 SCR 605.\n Constitution of India Art. 19(1) - 1960 SC 633 (9), 1962 SC 305 (25), 1962 SC 955 (21), 1966 SC 740 (48), 1967 SC 1643 (227), 1971 SC 2486 (8,13,14), 1973 SC 106 (16), 1986 SC 515 (22,24,33,97), 1989 SC 190 (11). Section 7 (1)(c) of the East Punjab Public Safety Act, 1949 is valid as it relates to matters that disturb public safety or cause public disorder, including those that \"undermine the security of, or tend to overthrow, the State\".\nThe Provincial Government of Delhi may, by order in writing addressed to a printer, publisher or editor, require that any matter relating to a particular subject or class of subjects be submitted for scrutiny before publication if it is satisfied that such action is necessary for preventing or combating any activity prejudicial to public safety or the maintenance of public order.\nThe Supreme Court of India held that Section 7 (1) (c) of the Constitution, which authorized the imposition of restrictions on the fundamental right of freedom of speech and expression guaranteed by Article 19 (1) (a) of the Constitution, was not a law relating to \"a matter which undermines the security of or tends to overthrow, the State\" within the meaning of Article 19 (2). The expression \"public safety\" is understood to mean the safety or security of the State, and the expression \"public order\" covers small disturbances of the peace that do not jeopardise the security of the State. This was established in the 1950 Supreme Court case Romesh Thappar v. The State. The Act is a special piece of legislation designed to protect public safety. The main purpose of the Act is to preserve public order and tranquillity, which are essential for the security of the State. The imposition of pre-censorship on a journal is a restriction on the liberty of the press which is an essential part of the right to freedom of speech and expression declared by Article 19 (1)(a) of the Constitution."}, {"id": "43023", "tagline": "Brij Bhushan And Another vs The State Of Delhi on 26 May, 1950", "judgment": "\nDr. N.B. Khare v. The State of Delhi, 1950 AIR 211, 1950 SCR 519, CJ Kania, Fazal Ali, Sastri, Mahajan, and Mukherjea, cited in 1952 SC 75, 1952 SC 196, 1956 SC 559, 1957 SC 510, 1957 SC 896, 1958 SC 578, 1959 SC 459, 1962 SC1371, 1964 SC1279, 1968 SC 445, 1971 SC1667, 1973 SC1461, 1974 SC 175, 1974 SC1044, 1975 SC2299.\nSection 4 of the East Punjab Public Safety Act of 1949 empowers the Provincial Government or District Magistrate to extern persons and authorizes externment for an indefinite period. The court must determine if these provisions are reasonable and if the Act is valid. A District Magistrate may, by order in writing, give a direction that a person shall remove himself from and not return to any area that may be specified in the order. The order will not remain in force for more than three months unless the Provincial Government directs otherwise. When an order has been made, the grounds of it may be communicated to the person affected. A petitioner applied to the court for a writ of certiorari, contending that an order passed under (1) (c) of the Act infringed on their fundamental right to move freely throughout the territory of India, which was guaranteed by Article 19 (1) (d) of the Constitution and was void under Article 13 (1) of the Constitution. The court held that there was nothing unreasonable in the provision contained in sub-s. (1) (c) empowering the Provincial Government to make orders restricting the movement of persons. The Supreme Court of India held that the restrictions imposed by the Act upon the fundamental right guaranteed by Article 19(1)(d) were reasonable and valid. Though certain authorities can be invested with power to make initial orders on their own satisfaction in cases of this description, the position would be different if the order thus made is allowed to continue for any indefinite period of time without giving the aggrieved person an opportunity to say what he has got to say against. Subsections 3 and 6 of Section 4 of the Act are unreasonable and inoperative under Article 13 (1) of the Constitution. The Supreme Court held that the externment order was illegal, as it violated the fundamental right of freedom of movement guaranteed by Article 19(1)(d) of the Indian Constitution. The Court also stated that when considering the reasonableness of the restrictions imposed on this right, the Court can consider not only the substantive part of the law, but also the procedural part and the circumstances under which the restrictions were imposed."}, {"id": "1321505", "tagline": "Dr. N.B. Khare vs The State Of Delhi on 26 May, 1950", "judgment": "\nNanalal Zaver and Another v. Bombay Life Assurance Co. Ltd. and Others, 04/05/1950, Kania, Hiralal J. (CJ), Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Das, Sudhi Ranjan, Mukherjea, B.K., 1950 AIR 172, 1950 SCR 391.\nA company was incorporated and an outsider attempted to gain control of the management by purchasing shares. The company issued further shares and offered them to existing shareholders. The validity of the resolution and offer was questioned, as the company was in need of funds and had an additional motive to prevent the outsider from gaining control. The scope of Section 105-C of the Indian Companies Act (1913) was discussed regarding the bona fides of the resolution.\nThe directors of the company, finding that a businessman was trying to get control of the company by purchasing its shares, resolved to issue the remaining 4,596 shares and offered these shares to the existing shareholders in proportion to their existing holdings. Two shareholders of a company sued the company and its directors for a declaration that the resolution of the directors to offer four new shares for every five shares held by them contravened the provisions of section 105-C of the Indian Companies Act, 1913, and was therefore illegal. The court held that the allotment of shares was illegal because it was not made in the interests of the company and restrained the defendants from allotting any more shares.\nThe two requirements of section 105-C were met, and the resolution and offer did not violate the section, even though 272 shares remained undistributed due to the offer of four new shares for every five shares. The Supreme Court ruled that the fact that one of the motives of the directors in issuing further shares was to prevent an outsider from getting control of the company did not render the resolution or offer illegal. The Bombay High Court's ruling was upheld, meaning that the resolution and offer to issue additional shares was legal, despite any bad motives that may have been present."}, {"id": "1679542", "tagline": "Nanalal Zaver And Another vs Bombay Life Assurance Co. Ltd.And ... on 4 May, 1950", "judgment": "\nCommissioner of Agricultural Income-Tax, Bengal v. Sri Keshab Chandra Mandal, 1950 AIR 265, 1950 SCR 435.\nThe Bengal Agricultural Income-tax Act, 1944 allows an illiterate assessee to file a return of income in Form No. 5, which must be signed by the assessee or his agent. In this case, the return was signed by the pen of the son of the assessee, and it was held that this was valid as the son was acting as an agent of the assessee. The principle \"qui facit per alium facit\" (he who acts through another, does it himself) applies in this case. The Rules framed under the Bengal Agricultural Income-tax Act, 1944 provided that the declaration in a return of income had to be signed by the individual themselves. An illiterate assessee, Keshab Chandra Mandal, signed his return in the vernacular.\nThe Appellate Tribunal referred to the High Court the question of whether, in the circumstances of the case, the declaration in the form of return signed by the illiterate assessee by the pen of his son Jugal Chandra Mandal was valid. The High Court affirmed that the Bengal Agricultural Income-tax Act, 1944 and its Rules indicated an intention to treat J.R. Bose's return as valid and properly signed. On appeal, the Supreme Court upheld this decision, with Mahajan J. dissenting. The common law rule qui tacit per alium tacit per se was excluded in the matter of affixing signature to the return of income made by an individual assessee, as there was no physical contact between the assessee and the return. The return signed by an illiterate assessee with the pen of his son was not a valid return. The Calcutta High Court's judgment was reversed because there was no evidence to suggest that the assessee did not touch the pen or the hand of the son when the signature was affixed."}, {"id": "254072", "tagline": "Commissioner Of ... vs Sri Keshab Chandra Mandal on 9 May, 1950", "judgment": "\nChief Controlling Revenue Authority and Superintendent of Stamps vs. Maharashtra Sugar Mills Ltd., judgment given on 27/05/1950 by Kania, Hiralal J. (CJ), Fazal Ali, Saiyid, Sastri, M. Patanjali, Mahajan, Mehr Chand, Mukherjea, B.K.\nThe Indian Stamp Act (II of 1899) outlines the power of the High Court to refer a case and its duty to do so upon request from a party affected. This answer addresses whether an order directing the Chief Controlling Authority to refer is valid. The High Court has original jurisdiction over matters concerning revenue, according to Section 266 (1) of the Government of India Act, 1935.\nCourt is not only for the benefit of the Revenue Authority, but also for the party affected by the assessment. Therefore, if called upon to do so, the court must make a reference. The court has the power to direct a party to make a reference to the court if they decline to do so. This was established in Alcock Ashdown & Co. Ltd. v. Chief Revenue Authority (50 I.A. 227) and Julius v. Bishop of Oxford (5). The High Court's order to a revenue officer to do his duty would not be considered the exercise of original jurisdiction in a matter concerning the revenue within the meaning of Section 226 of the Government of India Act, 1935. The court will direct the Chief Controlling Revenue Authority to make a reference under Section 57 of the Stamp Act, despite the fact that the proceedings had passed beyond the stage of enforcing Section 226 of the Government of India Act. The High Court can still direct the Revenue Authority to make a reference, even if payment has been made. If the opinion of the Court on the reference is against the Revenue Authority, they will have to refund whatever was recovered in excess, as per Section 59 (2) of the relevant Act."}, {"id": "269585", "tagline": "Chief Controlling Revenue ... vs Maharashtra Sugar Mills Ltd on 27 May, 1950", "judgment": "\nThe Province of Bombay challenged the order of requisitioning land by Kusaldas S. Advani and others. The Supreme Court held that the order of requisition was an administrative act and not a judicial or quasi-judicial act. The existence of public purpose was not a condition precedent to the exercise of power to requisition. The court also discussed the nature and incidents of writ of certiorari. A writ of certiorari lies whenever a body of persons having legal authority to determine questions affecting the rights of subjects and having the duty to act judicially act in excess of their legal authority. It does not lie to remove or adjudicate upon an order which is of an administrative or ministerial nature. The Government of Bombay is a body of persons having legal authority to determine questions affecting the rights of subjects and in deciding whether a land was required for a public purpose under s. 3 of the Ordinance it had to act judicially. The conditions necessary for the granting of a writ of certiorari were accordingly satisfied and the High Court of Bombay had power to issue the writ. However, when the executive authority has to form an opinion about an objective matter as a preliminary step to the exercise of a certain power conferred on it, the determination of the objective fact and the exercise of the power based thereon are alike matters of an administrative character and are not amenable to the writ of certiorari. It is well established that when a law or regulation entrusts an executive authority with the decision of what is necessary or expedient, and the authority makes the decision, it is not possible for courts to investigate the grounds or reasonableness of the decision in the absence of an allegation of bad faith. However, the determination of public purpose and the opinion formed as to the necessity or expediency of requisition form two distinct and independent steps, and if the executive authority fails to consider either step judicially, then their decision can be questioned. The High Court of Bombay had jurisdiction to issue a writ of certiorari in the case of a land requisition under s. 3 of the Ordinance, as the existence of a public purpose is an essential prerequisite for taking steps by the Provincial Government in the matter of requisitioning any property. The Provincial Government's determination of whether a public purpose exists or not is a judicial act, and a writ of certiorari can be issued in respect of it. However, if the question of the existence of a public purpose had been left to the subjective opinion of the Provincial Government, then it would not be a matter in respect of which a writ of certiorari could be issued. A body may be considered a quasi-judicial body if it has the legal authority to determine questions affecting the rights of subjects and is required by statute to act judicially. A mere provision for an enquiry as a preliminary step to coming to a decision will not necessarily make the decision a quasi-Judicial act. The Provincial Government of Bombay had the power to make an order for requisition under Section 3 of the Ordinance, but it was not mandatory for them to do so. The High Court of Bombay had jurisdiction to issue a writ of certiorari against the Provincial Government of Bombay, and the word \"sue\" in Section 176 of the Government of India Act, 1935, meant the enforcement of a claim or civil right by means of legal proceedings, which included an application for a writ of certiorari. Cases such as Rex v. Electricity Commissioners, Rex v. London County Council, The Queen v. Corporation of Dublin, Frome United Breweries v. Bath Justices, Rex v. Archbishop of Canterbury, Rex v. Woodhouse,"}, {"id": "1954356", "tagline": "Province Of Bombay vs Kusaldas S. Advani And Others on 15 September, 1950", "judgment": "\nA court case in 1950 between Gnanambal Ammal and T. Raju Ayyar and others regarding the construction of a Hindu will. The cardinal maxim to be observed by courts in construing a will is to ascertain the intentions of the testator. The courts must consider the language of the document as a whole, as well as the surrounding circumstances, the testator's family relationship, and other factors when interpreting a will. The court is only allowed to interpret the will of a testator in order to ascertain its meaning. Once the construction is settled, the court must carry out the intentions as expressed in the will. The court is not allowed to add anything to the testamentary dispositions. A presumption against intestacy can be raised if the context of the document or surrounding circumstances justify it, but only when there is ambiguity in determining the testator's intentions. It cannot be used to avoid intestacy without clear evidence of the testator's wishes. In the event that the Hindu's widow adopts her married daughter G's son, all of his properties except the village of K and the house at I, as well as any other properties disposed of by the will, shall pass. In a will, the village of K and the house a I were given to the adopted son with life interest, and after him it would pass to the daughter G and her children on payment of Rs. 5,000 to A, the daughter of N. Later, there was a provision that if a son of a nephew was adopted, they would receive the same benefits.\nHeld, on a construction of the will as a whole, that the testator did not intend for the village of K to vest in the nephew's son after N's death. The High Court of Madras' judgment was reversed, and the provisions of para. 5 of the will were intended to apply even in the case of an adopted son. Venkatanarasimha v. Parthasarathy (41 I.A. 51) and Re Edward; Jones v. Jones [1906] 1 Ch. 5701 were referred to."}]